<p align="center">
    <a target="_blank" href="https://pluridoc.plurid.com">
        <img src="https://raw.githubusercontent.com/plurid/pluridoc/master/about/identity/pluridoc-logo.png" height="250px">
    </a>
    <br />
    <a target="_blank" href="https://github.com/plurid/pluridoc/blob/master/LICENSE">
        <img src="https://img.shields.io/badge/license-MIT-blue.svg?colorB=1380C3&style=for-the-badge" alt="License: MIT">
    </a>
</p>


<h1 align="center">
    pluridoc
</h1>


## Document Format

A `pluridoc` is a files container for multiple `plurid` spaces. A `plurid` space is generated by interpreting a `.plurid` file. Hence, a `pluridoc` is a container of multiple `.plurid` files.

A `plurid` file is a file using the extension `.plurid` which contains `plurid` planes:

The following represents a `plurid` file with two `plurid` planes

```
<<<
plane 1
>>>

<<<
plane 2
>>>
```

The delimiters, `<<<` and `>>>`, represent the start, respectively, the end of a plurid plane.

A `plurid` plane can have various attributes such as `id`, `title`, `path`, `cluster`, and more.

A `plurid` file can have a special configuration section, usually at the top of the file.

```
<<< configuration
title: two planes with configured title
// location
>>>

<<<
plane 1
>>>

<<<
plane 2
>>>
```

Multiple configuration sections are merged into one. The actual configuration will use the last defined property.

Inside the plurid plane there can be any content, and if the `processor` property is specified, the content will be rendered based on the appropriate syntax (i.e., `markdown`, `typescript`, `python`, `text`, and so on). However, a special `plurid link` element can be inserted at any place of the text.


```
<<< id: plane-one
plane 1 with link to ::|plane-two:::plane 2|::
>>>

<<< id: plane-two
plane 2
>>>
```

The `plurid link` syntax is formed from

```
::|plurid-plane-id:::link text|::
 |        |        |     |     | ending separator
 |        |        |     |
 |        |        |     | the text to be displayed for the link
 |        |        |
 |        |        | middle separator
 |        |
 |        | the plurid link properties
 |
 | start separator for the plurid link
```

The `plurid link` has one required property, the target of the link: the `id` or `path` of a `plurid plane`.

A `plurid link` can link across documents from the same `.pluridoc` specifying the `document` property. Such a link would look like

```
::|id: plurid-plane-id; document: id-of-another-document:::link text|::
```
